// ## TASK-01

// Написати фунцію, яка буде визначати чи є буква в слові на визначеній позиції.

// ##### Arguments:

// - _word_ - слово, на якому треба буде перевіряти наявність букви
// - _index_ - позиція символу на якому треба перевірити здогадку
// - _char_ - буква, наявність якої треба перевіряти в слові

// ##### Return value

// true або false, залежно від того є буква в слові чи ні.

// let word = 

// let findChar = function (word) {
//   let CharArray = word.split();
//   console.log(CharArray);
// };

// // let char = prompt('' , "Введіть будь який символ, але бажано букву латиницею )");


// // let index = +prompt ('', 'На Вашу думку, на якій позиції, в загаданому спочатку словi, знаходиться буква, яку ви загадали?');

// findChar(prompt('' , "Придумайте і введіть слово"));

// __________________________________________________------------------------------------------------------_______________________________________________________________________________________________________________
// ## TASK-03

// Напишіть гру для відгадування слова.

// #### Game flow:

// - Спитати чи користувач хоче зіграти у гру?
// - Попросити користувача загадати слово.
// - Для кожного символу у загаданому слові, перевірити чи є такий символ у слові взагалі та чи співпадає здогадка користувача із символом на поточній позиції.
// - Якщо здогадка користувача _вірна_ - переходити до наступного символу
// - Якщо здогадка користувача _не вірна_ - повторювати запит символу допоки не набереться 5 помилкових здогадок, далі - вивести в консоль "You lose!". Якщо одна зі здогадок виявилася вірною - переходити на відгадування наступного символу.
// - Якщо користувач виграв - вивести у консоль "You win!"

let charPosition = [
  "першій",
  "другій",
  "третій",
  "четвертій",
  "п'ятій",
  "шостій",
  "сьомій",
  "восьмій",
  "дев'ятій",
  "десятій"
];


let game = function () {
  let askedWords = prompt('ОК, придумай слово!');

  let charArray = askedWords.split('');
  console.log(charArray);
  let errorsCounter = 0;
  if (errorsCounter < 5) {
    for (let i = 0; i < charArray.length; i++) {
      let supousedChar = prompt('Як гадаєш яка буква на' + charPosition[i] + ' позиції у загаданому слові?');
      if (charArray[i] === supousedChar) {
        alert('Вірно, переходим до наступної букви');
      }; if (errorsCounter == 5) {
        alert('You lose!');
        break
      }; else {errorsCounter += errorsCounter};
    };
  };
}

let mainQestion = confirm('Привіт, завай зіграємо в гру!?');

if (mainQestion) {
  game ()
} else {alert('Щож, якщо захочеш заробити шальних бабок- оновиш сторінку');
};

