export const textHeroSection = {
  heroSlogan: 'Будь сильним!<br>Ставай кращим!<br>Завжди та повсюду',
  heroDescription:
    "Фізична активність дає змогу сучасній людині повертатись до свого я, звернути увагу на своє тіло і відчути його, розвантажити мозок і привести до ладу думки. Для нашої команди спорт асоціюється з такими словами, як здоров'я, дисципліна, медитація і чудовий настрій. Ми любимо тренуватись на вулиці, оскільки, окрім спорту, ми любимо наше місто - Київ. Саме турніки дають можливість не прив'язуватись до одного місця, фіксованого часу та закритого приміщення. Ви можете уявити себе легендарним Майком Тайсоном, який тренувався на вулиці коли ще не встало сонце і з'являвся вранішній туман. Або можете уявити себе вигаданим Рокі Бальбоа, який тренувався як скажений при будь-якій погоді. Ким би ви себе не відчували, я поділюсь з вами кращими спортивними майданчиками Києва",
};
