export const GOODS__PLANTS = [
  {
    name: 'Бузок',
    image:
      'https://florium.ua/media/catalog/product/cache/1/file/9df78eab33525d08d6e5fb8d27136e95/b/u/buzok-charles-joly.jpg',
    description:
      'Бузок Charles Joly - Бузок звичайний Чарльз Джолі - прекрасний красивоквітучий розлогий чагарник. Висота куща 3-5 м, діаметр крони 3,5-4 см. Квітки махрові, пурпурно-червоні, зібрані в вузькопірамідальне суцвіття. Листки темно-зелені серцевидні. Щорічний приріст у висоту і ширину 20-30 см. Цвіте в кінці травня початку червня.',
    price: '250 грн',
    buttonToCart: 'Додати',
  },

  {
    name: 'Лаванда',
    image:
      'https://www.lovethegarden.com/sites/default/files/content/articles/UK_plant-finder-herbs-lavender_main.jpg',
    description:
      'Вирощування лаванди в домашніх умовах трохи складніше. Якщо на ділянці рослина перенесе незначну тінь та опади, то в домашніх умовах лаванді буде потрібний ретельний догляд та дотримання температури.',
    price: '80 грн',
    buttonToCart: 'Додати',
  },

  {
    name: 'Форзиція',
    image:
      'https://florium.ua/media/catalog/product/cache/1/file/9df78eab33525d08d6e5fb8d27136e95/f/o/forziciya-minigold3.jpg',
    description:
      'Форзиція - ранньоквітучих красивоквітучий листопадний чагарник заввишки 0,7 1м. Форма крони щільна, округла не вимагає формування. Кущ форзиції розквітає ще до розпускання листя, її гілки густо обсипані золотистими квітками, схожими на дзвіночки. Час цвітіння - березень-квітень. Забарвлення квіток - світло-жовте. Діаметр квіток 2-3 см. Неймовірно рясне цвітіння.',
    price: '150 грн',
    buttonToCart: 'Додати',
  },

  {
    name: 'Деревовидний піон',
    image:
      'https://landscapeplants.oregonstate.edu/sites/plantid7/files/plantimage/pasu3097A.jpg',
    description:
      "У міру зростання, деревовидний піон виросте до півтора - двох метрів, також існують і компактні сорти. Доросла рослина формує широкий кущ, на прямих, задерев'янілих стеблах формуються великі бутони, що досягають 12 см в діаметрі.",
    price: '250 грн',
    buttonToCart: 'Додати',
  },

  {
    name: 'Рододендрон',
    image:
      'https://idea-sad.com.ua/files/products/rododendron-emanuela1emagot.460x460.jpg',
    description:
      'Рододендрон Кальсап (Рододендрон Calsap) - вічнозелений не листопадний чагарник з морозостійкістю до - 30 морозу. Висота до 1,5 м, діаметр крони до 1,6 м. Щорічний приріст у висоту і ширину 5-10 см. Довговічність понад 30 років. Крона рододендрона Calsap розлога. Листя темно-зелене еліптичне, еліптичне, шкірясте, блискуче, довжиною 10-12 см.',
    price: '500 грн',
    buttonToCart: 'Додати',
  },
];
