import veselkaPark from '@/images/content_img/20210606_180235.jpg';

export const ironPlaygroundsCollection = [
  {
    title: 'Пaрк Веселка',
    photo: veselkaPark,
    coordinates: 'unknown',
    description:
      'Класний майданчик, зі зручними турнічками. Є і турнік і бруси. Тут правда багато дітей і буває, що вони заважають. Влітку збирається багато любителів потренити- сумно не буде, або буде на кого рівнятись. Гарний маленький парк зі старими деревами. Плюсом буде присутність безкоштовного туалета',
    rate: 5,
    author: 'AKot',
  },
  {
    title: 'Парк Наталка на берегу Дніпра',
    photo: veselkaPark,
    coordinates: 'unknown',
    description:
      'Крутий майданчик, декілька турніків. Трохи товсті бруси, проте є поперечина для австралійських підтягувань. Поруч баскетбольний та волейбольний майданчики, багато зівак, вид на Дніпро і Північний міст- один з найкращих загально доступних місць',
    rate: 5,
    author: 'AKot',
  },
  {
    title: 'Таємний майданчик на Андріївському',
    photo: veselkaPark,
    coordinates: 'unknown',
    description:
      'Таємний майданчик на андріївському. Круте місце, щоб позайматись, якщо ви просто гуляєтек по місту, або хочете відчути себе з ним единим цілим. Майданчик один з найкомпактніших, виконаний з нержавійючої сталі, що не завжди зручно. Кажуть сам пан Голохвастов тренувався саме на цьому майданчику. Поруч е муніципальний платний туалет',
    rate: 5,
    author: 'AKot',
  },
  {
    title: 'Паркінг Труханів острів',
    photo: veselkaPark,
    coordinates: 'unknown',
    description:
      'Один з трьох майданчиків на цій локації. Зручно що прям біля паркінгу. Високуватий турнік і бруси трохи різні по висоті (різниця в 1 сантиметр, проте ви відчуєте її). Туалету поруч немає, тому всі бігають під стару грушу поруч',
    rate: 4,
    author: 'AKot',
  },
  {
    title: 'Парк Муромець Труханів острів',
    photo: veselkaPark,
    coordinates: 'unknown',
    description:
      'Майданчик, який сховався у парку Муромець одразу через місток за вейк-базою. Прикольний, майже пляжний майданчик ще радянського типу. Присутні турнік, бруси та і все, але саме тут ви маєте можливість знайти місце для купання',
    rate: 4,
    author: 'AKot',
  },
];
